Repository: KOPElan/pixshift
Catalog: PicTool/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# batch.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# batch.cancelled
source: Processing cancelled; generated files were removed.
zh_hans: 处理已取消，本次生成的文件已清理。
zh_hant: 處理已取消，本次產生的檔案已清理。

# batch.cleaning
source: Cleaning up…
zh_hans: 正在清理…
zh_hant: 正在清理…

# batch.cleanup_failed
source: Some generated files could not be removed
zh_hans: 部分生成文件无法清理
zh_hant: 部分產生的檔案無法清理

# batch.cleanup_failed_count
source: %lld files remain.
zh_hans: 仍有 %lld 个文件未清理。
zh_hant: 仍有 %lld 個檔案未清理。

# batch.completed
source: Processing complete
zh_hans: 处理完成
zh_hant: 處理完成

# batch.preparing
source: Checking output folders…
zh_hans: 正在检查导出目录…
zh_hant: 正在檢查匯出資料夾…

# batch.processing
source: Processing…
zh_hans: 正在处理…
zh_hant: 正在處理…

# batch.result
source: %lld succeeded, %lld failed.
zh_hans: 成功 %lld 张，失败 %lld 张。
zh_hant: 成功 %lld 張，失敗 %lld 張。

# batch.start
source: Start Processing
zh_hans: 开始处理
zh_hant: 開始處理

source: Batch Status
zh_hans: 批处理状态
zh_hant: 批次處理狀態

# common.ok
source: OK
zh_hans: 好
zh_hant: 好

# crop.adjust
source: Adjust Crop Area…
zh_hans: 调整裁剪区域…
zh_hant: 調整裁切區域…

# crop.apply_all
source: Apply to All
zh_hans: 应用到全部
zh_hant: 套用至全部

# crop.apply_all_help
source: The same aspect ratio and relative position will be applied to every image.
zh_hans: 同一比例和相对位置将应用到所有图片，不支持逐张调整。
zh_hant: 相同的比例和相對位置將套用至所有圖片，不支援逐張調整。

# crop.batch_help
source: One normalized crop position is applied to the entire batch.
zh_hans: 同一归一化裁剪位置将应用到整个批次。
zh_hant: 相同的正規化裁切位置將套用至整個批次。

# crop.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

source: Crop canvas
zh_hans: 裁剪画布
zh_hant: 裁切畫布

# crop.centered
source: Centered
zh_hans: 居中
zh_hant: 置中

# crop.coming_next
source: Interactive crop editing is scheduled for the next milestone.
zh_hans: 交互式裁剪将在下一个里程碑实现。
zh_hant: 互動式裁切將於下一個里程碑實作。

# crop.disabled_help
source: No additional crop. Exact dimensions still use a centered crop when needed.
zh_hans: 不额外裁剪；指定宽高时仍会按需居中裁剪。
zh_hant: 不額外裁切；指定寬高時仍會視需要置中裁切。

# crop.enable
source: Enable Crop
zh_hans: 启用裁剪
zh_hant: 啟用裁切

# crop.handle.bottom
source: Bottom crop handle
zh_hans: 下方裁剪控制柄
zh_hant: 下方裁切控制點

# crop.handle.bottom_left
source: Bottom-left crop handle
zh_hans: 左下裁剪控制柄
zh_hant: 左下裁切控制點

# crop.handle.bottom_right
source: Bottom-right crop handle
zh_hans: 右下裁剪控制柄
zh_hant: 右下裁切控制點

# crop.handle.left
source: Left crop handle
zh_hans: 左侧裁剪控制柄
zh_hant: 左側裁切控制點

# crop.handle.right
source: Right crop handle
zh_hans: 右侧裁剪控制柄
zh_hant: 右側裁切控制點

# crop.handle.top
source: Top crop handle
zh_hans: 上方裁剪控制柄
zh_hant: 上方裁切控制點

# crop.handle.top_left
source: Top-left crop handle
zh_hans: 左上裁剪控制柄
zh_hant: 左上裁切控制點

# crop.handle.top_right
source: Top-right crop handle
zh_hans: 右上裁剪控制柄
zh_hant: 右上裁切控制點

# crop.no_image
source: No image available
zh_hans: 没有可用图片
zh_hant: 沒有可用圖片

# crop.ratio
source: Aspect Ratio
zh_hans: 裁剪比例
zh_hant: 裁切比例

# crop.ratio_height
source: Height
zh_hans: 高
zh_hant: 高

# crop.ratio_width
source: Width
zh_hans: 宽
zh_hant: 寬

# crop.ratio.custom
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# crop.ratio.free
source: Free
zh_hans: 自由
zh_hant: 自由

# crop.ratio.original
source: Original
zh_hans: 原始比例
zh_hant: 原始比例

# crop.representative
source: Representative Image
zh_hans: 代表图片
zh_hant: 代表圖片

# crop.reset_center
source: Reset to Center
zh_hans: 重置为居中
zh_hant: 重設為置中

# crop.section
source: Crop
zh_hans: 裁剪
zh_hant: 裁切

# crop.status
source: Position
zh_hans: 位置
zh_hant: 位置

# error.destination_exists
source: The output file already exists.
zh_hans: 导出文件已存在。
zh_hant: 匯出檔案已存在。

# error.encoder_unavailable
source: The selected encoder is unavailable.
zh_hans: 所选格式的编码器不可用。
zh_hant: 所選格式的編碼器無法使用。

# error.invalid_dimensions
source: Image dimensions must be positive.
zh_hans: 图片尺寸必须为正数。
zh_hant: 圖片尺寸必須為正數。

# error.invalid_scale
source: Scale must be greater than zero.
zh_hans: 缩放比例必须大于零。
zh_hant: 縮放比例必須大於零。

# error.processing_failed
source: Processing failed.
zh_hans: 处理失败。
zh_hant: 處理失敗。

# error.unknown
source: An unknown error occurred.
zh_hans: 发生未知错误。
zh_hant: 發生未知錯誤。

# error.unreadable_image
source: The image could not be read.
zh_hans: 无法读取图片。
zh_hant: 無法讀取圖片。

# export.choose_folder
source: Choose Folder…
zh_hans: 选择文件夹…
zh_hant: 選擇資料夾…

# export.destination
source: Destination
zh_hans: 导出位置
zh_hant: 匯出位置

# export.destination.sourceFolder
source: Each Source Folder
zh_hans: 各自原图目录
zh_hant: 各自原圖資料夾

# export.destination.unifiedFolder
source: One Folder
zh_hans: 统一目录
zh_hant: 統一資料夾

# export.folder
source: Folder
zh_hans: 文件夹
zh_hant: 資料夾

# export.format
source: Format
zh_hans: 格式
zh_hant: 格式

# export.format.keepOriginal
source: Original Format
zh_hans: 原格式
zh_hant: 原始格式

# export.keep_original
source: Keep Original
zh_hans: 保持原格式
zh_hant: 保留原始格式

# export.naming_template
source: Filename Template
zh_hans: 文件名规则
zh_hant: 檔名規則

# export.quality
source: Quality
zh_hans: 品质
zh_hant: 品質

# export.section
source: Export
zh_hans: 导出
zh_hant: 匯出

# export.source_folder
source: Source Folder
zh_hans: 原图片所在目录
zh_hant: 原始圖片所在資料夾

# import.add_files
source: Add Images…
zh_hans: 添加图片…
zh_hant: 加入圖片…

# import.add_folder
source: Add Folder…
zh_hans: 添加文件夹…
zh_hant: 加入資料夾…

# import.choose
source: Choose
zh_hans: 选择
zh_hant: 選擇

# import.choose_files
source: Choose Images
zh_hans: 选择图片
zh_hant: 選擇圖片

# import.choose_folder
source: Choose Folder
zh_hans: 选择文件夹
zh_hant: 選擇資料夾

# import.empty_description
source: Drop images or folders here. JPEG, PNG, WebP, HEIC, and TIFF are supported.
zh_hans: 将图片或文件夹拖到这里。支持 JPEG、PNG、WebP、HEIC 和 TIFF。
zh_hant: 將圖片或資料夾拖到這裡。支援 JPEG、PNG、WebP、HEIC 和 TIFF。

# import.empty_title
source: Add Images
zh_hans: 添加图片
zh_hant: 加入圖片

# import.error_title
source: Some Images Could Not Be Added
zh_hans: 部分图片无法添加
zh_hant: 部分圖片無法加入

# import.loading
source: Importing…
zh_hans: 正在导入…
zh_hant: 正在匯入…

# import.partial_failure
source: %d images could not be read.
zh_hans: %d 张图片无法读取。
zh_hant: %d 張圖片無法讀取。

# ledger.failed
source: The safety ledger could not be updated. Processing stopped.
zh_hans: 无法更新安全运行台账，处理已停止。
zh_hant: 無法更新安全執行記錄，處理已停止。

# permission.authorize
source: Authorize Folders
zh_hans: 授权文件夹
zh_hant: 授權資料夾

# permission.failed
source: Folder authorization required
zh_hans: 需要文件夹授权
zh_hant: 需要資料夾授權

# permission.failed_count
source: %lld output folders are not writable. No files were created.
zh_hans: %lld 个导出目录不可写，未创建任何文件。
zh_hant: %lld 個匯出資料夾無法寫入，未建立任何檔案。

# permission.message
source: PixShift needs access to %lld output folders. Select the folders, or a common parent folder, to continue.
zh_hans: PixShift 需要访问 %lld 个导出目录。请选择这些文件夹或它们的共同父文件夹以继续。
zh_hant: PixShift 需要存取 %lld 個匯出資料夾。請選擇這些資料夾或它們的共同上層資料夾以繼續。

source: PixShift: Resize & Convert Images
zh_hans: PixShift：调整尺寸与转换图片
zh_hant: PixShift：調整尺寸與轉換圖片

# queue.clear
source: Clear
zh_hans: 清空
zh_hant: 清空

# queue.dimensions
source: Dimensions
zh_hans: 尺寸
zh_hant: 尺寸

# queue.format
source: Format
zh_hans: 格式
zh_hant: 格式

# queue.ignored_count
source: ignored
zh_hans: 个已忽略
zh_hant: 個已略過

# queue.image
source: Image
zh_hans: 图片
zh_hant: 圖片

# queue.remove
source: Remove
zh_hans: 移除
zh_hant: 移除

# queue.valid_count
source: images
zh_hans: 张图片
zh_hant: 張圖片

# recovery.available
source: Files from an interrupted run need attention
zh_hans: 上次中断任务的文件需要处理
zh_hant: 上次中斷工作的檔案需要處理

# recovery.cleaning
source: Cleaning files from the interrupted run…
zh_hans: 正在清理上次中断任务的文件…
zh_hant: 正在清理上次中斷工作的檔案…

# recovery.cleanup
source: Delete Generated Files
zh_hans: 删除生成文件
zh_hant: 刪除產生的檔案

# recovery.failed
source: Some interrupted-run files could not be removed
zh_hans: 部分中断任务文件无法清理
zh_hant: 部分中斷工作的檔案無法清理

# recovery.failed_count
source: %lld files remain. PixShift will keep the safety ledger.
zh_hans: 仍有 %lld 个文件未清理，PixShift 将保留安全台账。
zh_hant: 仍有 %lld 個檔案未清理，PixShift 將保留安全執行記錄。

# recovery.keep
source: Keep Files
zh_hans: 保留文件
zh_hant: 保留檔案

# recovery.message
source: PixShift found %lld file records from a run that did not finish. Delete only those recorded files, or keep them and discard the safety ledger?
zh_hans: PixShift 发现上次未完成任务留下的 %lld 条文件记录。要仅删除这些已登记文件，还是保留文件并放弃安全台账？
zh_hant: PixShift 發現上次未完成工作留下的 %lld 筆檔案記錄。要僅刪除這些已登記的檔案，還是保留檔案並捨棄安全執行記錄？

# recovery.title
source: Interrupted Run Found
zh_hans: 发现中断的任务
zh_hant: 發現中斷的工作

# resize.allow_upscaling
source: Allow Upscaling
zh_hans: 允许放大
zh_hant: 允許放大

# resize.exact_help
source: Images with a different aspect ratio are center-cropped and never stretched.
zh_hans: 比例不同时将居中裁剪，不会拉伸图片。
zh_hant: 比例不同時將置中裁切，不會拉伸圖片。

# resize.height
source: Height
zh_hans: 高度
zh_hant: 高度

# resize.mode
source: Mode
zh_hans: 模式
zh_hant: 模式

# resize.mode.exact
source: Exact Width & Height
zh_hans: 指定宽度和高度
zh_hant: 指定寬度和高度

# resize.mode.fixedHeight
source: Fixed Height
zh_hans: 固定高度
zh_hant: 固定高度

# resize.mode.fixedWidth
source: Fixed Width
zh_hans: 固定宽度
zh_hant: 固定寬度

# resize.mode.longestEdge
source: Longest Edge
zh_hans: 限制最长边
zh_hant: 限制最長邊

# resize.mode.percentage
source: Percentage
zh_hans: 按百分比
zh_hant: 依百分比

# resize.mode.shortestEdge
source: Shortest Edge
zh_hans: 限制最短边
zh_hant: 限制最短邊

# resize.percentage
source: Percentage
zh_hans: 百分比
zh_hant: 百分比

# resize.pixels
source: Pixels
zh_hans: 像素
zh_hant: 像素

# resize.section
source: Resize
zh_hans: 尺寸
zh_hant: 尺寸

# resize.upscaling_warning
source: Upscaling can reduce image quality.
zh_hans: 放大图片可能降低画质。
zh_hant: 放大圖片可能降低畫質。

# resize.width
source: Width
zh_hans: 宽度
zh_hant: 寬度

# settings.general
source: General
zh_hans: 通用
zh_hant: 一般

# settings.language
source: Language
zh_hans: 语言
zh_hant: 語言

# settings.language.system
source: Follow System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# settings.local_only
source: This count is stored only on this Mac and is never uploaded.
zh_hans: 该计数仅保存在这台 Mac 上，永远不会上传。
zh_hant: 此計數僅儲存在這台 Mac 上，永遠不會上傳。

# settings.naming
source: Naming
zh_hans: 命名
zh_hant: 命名

# settings.naming_help
source: Available variables: {name}, {width}, {height}, {index}, {ext}
zh_hans: 可用变量：{name}、{width}、{height}、{index}、{ext}
zh_hant: 可用變數：{name}、{width}、{height}、{index}、{ext}

# settings.naming_template
source: Template
zh_hans: 模板
zh_hant: 範本

# settings.quality
source: Default Quality
zh_hans: 默认品质
zh_hant: 預設品質

# settings.statistics
source: Statistics
zh_hans: 统计
zh_hant: 統計

# settings.successful_count
source: Successfully Processed Images
zh_hans: 成功处理图片数量
zh_hant: 成功處理圖片數量
